Repository: esN2k/SelcukAiAssistant
Catalog: lib/l10n/app_*.arb
Languages: tr

# appTitle
source: Selcuk AI Assistant
tr: Selçuk YZ Asistan

# appSubtitle
source: Selcuk AI Assistant
tr: Selçuk YZ Asistan

# splashSubtitle
source: Selcuk AI Assistant
tr: Selçuk YZ Asistan

source: OK
tr: Tamam

source: Cancel
tr: Ä°ptal

source: Delete
tr: Sil

source: Clear
tr: Temizle

source: Rename
tr: Yeniden adlandÄ±r

source: New chat
tr: Yeni sohbet

# loginTitle
source: Welcome back
tr: HoÅŸ geldiniz

# loginSubtitle
source: Sign in to continue
tr: Devam etmek iÃ§in giriÅŸ yapÄ±n

# loginButton
source: Sign in
tr: GiriÅŸ yap

# loginNoAccount
source: Don't have an account?
tr: HesabÄ±nÄ±z yok mu?

# loginCreateAccount
source: Create account
tr: KayÄ±t olun

# loginSuccessTitle
source: Success
tr: BaÅŸarÄ±lÄ±

# loginSuccessMessage
source: Signed in successfully!
tr: GiriÅŸ yapÄ±ldÄ±!

# loginErrorTitle
source: Error
tr: Hata

# registerTitle
source: Create account
tr: Hesap oluÅŸtur

# registerSubtitle
source: Start using the assistant
tr: AsistanÄ± kullanmaya baÅŸlayÄ±n

# registerButton
source: Create account
tr: KayÄ±t ol

# registerHaveAccount
source: Already have an account?
tr: Zaten hesabÄ±nÄ±z var mÄ±?

# registerSignIn
source: Sign in
tr: GiriÅŸ yap

# registerSuccessTitle
source: Success
tr: BaÅŸarÄ±lÄ±

# registerSuccessMessage
source: Registration complete. Welcome!
tr: KayÄ±t tamamlandÄ±. HoÅŸ geldiniz!

# registerErrorTitle
source: Error
tr: Hata

# nameLabel
source: Full name
tr: Ad soyad

# emailLabel
source: Email
tr: E-posta

# passwordLabel
source: Password
tr: Åifre

# confirmPasswordLabel
source: Confirm password
tr: Åifre tekrar

# nameRequired
source: Full name is required
tr: Ad soyad gerekli

# emailRequired
source: Email is required
tr: E-posta gerekli

# invalidEmail
source: Enter a valid email
tr: GeÃ§erli bir e-posta girin

# passwordRequired
source: Password is required
tr: Åifre gerekli

# passwordMinLength
source: Password must be at least 8 characters
tr: Åifre en az 8 karakter olmalÄ±

# confirmPasswordRequired
source: Please confirm your password
tr: Åifre tekrarÄ±nÄ± girin

source: Passwords do not match
tr: Åifreler eÅŸleÅŸmiyor

# onboardingTitle1
source: Ask me anything
tr: Bana bir ÅŸey sor

# onboardingSubtitle1
source: I can be your best companion. Ask me anything and I will help!
tr: En iyi yol arkadaÅŸÄ±n olabilirim. Bana her ÅŸeyi sor, yardÄ±mcÄ± olayÄ±m!

# onboardingTitle2
source: From imagination to reality
tr: Hayalden gerÃ§eÄŸe

# onboardingSubtitle2
source: Just imagine and tell me. I will create something great for you!
tr: Sadece hayal et ve sÃ¶yle. Senin iÃ§in harika bir ÅŸey yaratayÄ±m!

# onboardingNext
source: Next
tr: SÄ±radaki

# onboardingDone
source: Done
tr: Bitti

# settingsTitle
source: Settings
tr: Ayarlar

# sectionAppearance
source: APPEARANCE
tr: GÃ–RÃœNÃœM

# sectionLanguage
source: LANGUAGE
tr: DÄ°L

# sectionAiModel
source: AI MODEL
tr: YAPAY ZEKA MODELÄ°

# sectionChatSettings
source: CHAT SETTINGS
tr: SOHBET AYARLARI

# sectionServer
source: SERVER
tr: SUNUCU

# sectionDiagnostics
source: DIAGNOSTICS
tr: TANILAMA

# sectionStatistics
source: STATISTICS
tr: Ä°STATÄ°STÄ°KLER

# sectionDataManagement
source: DATA MANAGEMENT
tr: VERÄ° YÃ–NETÄ°MÄ°

# sectionAbout
source: ABOUT
tr: HAKKINDA

# darkModeTitle
source: Dark mode
tr: KaranlÄ±k mod

# darkModeSubtitle
source: Toggle between light and dark theme
tr: AydÄ±nlÄ±k ve karanlÄ±k tema arasÄ±nda geÃ§iÅŸ yapÄ±n

# languageTitle
source: App language
tr: Uygulama dili

# languageSubtitle
source: Choose your preferred language
tr: Tercih ettiÄŸiniz dili seÃ§in

# languageTurkish
source: Turkish
tr: TÃ¼rkÃ§e

# languageEnglish
source: English
tr: Ä°ngilizce

# modelNotSelected
source: Not selected
tr: SeÃ§ilmedi

# modelAvailable
source: Available
tr: Uygun

# modelUnavailable
source: Unavailable
tr: Kullanilamaz

# modelLocalSection
source: Local models
tr: Yerel modeller

# modelRemoteSection
source: Remote / API models
tr: Uzak / API modelleri

# modelInstallCommand
source: Install: {command}
tr: Kurulum: {command}

# modelUnavailableReason
source: Reason: {reason}
tr: Neden: {reason}

# modelSearchHint
source: Search models...
tr: Model ara...

# modelNoResults
source: No models found
tr: Model bulunamadı

# modelApiKeyRequired
source: API key required
tr: API anahtarı gerekli

# modelNotInstalled
source: Not installed
tr: Yüklü değil

# modelContextLength
source: Context: {count} tokens
tr: Bağlam: {count} belirteç

# backendUrlTitle
source: Backend URL
tr: Sunucu URL'si

# backendUrlSubtitle
source: Current: {current}
tr: Geçerli: {current}

# backendUrlHint
source: https://example.com:8000 or /api
tr: https://example.com:8000 veya /api

# backendUrlSave
source: Save
tr: Kaydet

# backendUrlClear
source: Clear override
tr: Özel ayarı temizle

source: Backend URL saved
tr: Sunucu URL'si kaydedildi

# backendUrlCleared
source: Backend URL override cleared
tr: Sunucu URL'si özelleştirmesi temizlendi

# diagnosticsTitle
source: Diagnostics
tr: Tanılama

# diagnosticsSubtitle
source: Test backend connectivity and streaming
tr: Backend baglantisi ve streaming testi

# selectModelTitle
source: Select model
tr: Model sec

# voiceInputTitle
source: Voice input
tr: Sesli giris

# voiceInputSubtitle
source: Enable microphone for voice messages
tr: Sesli mesajlar icin mikrofonu etkinlestirin

# markdownSupportTitle
source: Markdown support
tr: Markdown destegi

# markdownSupportSubtitle
source: Render formatted text and code
tr: Bicimlendirilmis metin ve kodu goster

# ragEnabledTitle
source: Source-grounded answers (RAG)
tr: Kaynakli yanitlar (RAG)

# ragEnabledSubtitle
source: Use indexed documents as context when available
tr: Uygunsa dizinlenen belgelerden yanit uretir

# ragStrictTitle
source: Strict source mode
tr: Siki kaynak modu

# ragStrictSubtitle
source: If sources are missing, reply with a fixed notice
tr: Kaynak yoksa sabit uyari verir

source: Total conversations
tr: Toplam konuÅŸma

source: Total messages
tr: Toplam mesaj

# clearAllConversationsTitle
source: Clear all conversations
tr: TÃ¼m konuÅŸmalarÄ± temizle

# clearAllConversationsSubtitle
source: Delete all chat history
tr: TÃ¼m sohbet geÃ§miÅŸini silin

# clearAllDataTitle
source: Clear all data
tr: TÃ¼m verileri temizle

# clearAllDataMessage
source: Are you sure you want to delete all conversations? This action cannot be undone.
tr: TÃ¼m konuÅŸmalarÄ± silmek istediÄŸinize emin misiniz? Bu iÅŸlem geri alÄ±namaz.

source: Delete all
tr: TÃ¼mÃ¼nÃ¼ sil

# clearAllSuccessTitle
source: Success
tr: BaÅŸarÄ±lÄ±

# clearAllSuccessMessage
source: All conversations deleted
tr: TÃ¼m konuÅŸmalar silindi

# versionLabel
source: Version
tr: SÃ¼rÃ¼m

# developerLabel
source: Developer
tr: GeliÅŸtirici

# deleteConversationTitle
source: Delete conversation
tr: KonuÅŸmayÄ± sil

# deleteConversationMessage
source: Are you sure you want to delete this conversation? This action cannot be undone.
tr: Bu konuÅŸmayÄ± silmek istediÄŸinize emin misiniz? Bu iÅŸlem geri alÄ±namaz.

# renameConversationTitle
source: Rename conversation
tr: KonuÅŸmayÄ± yeniden adlandÄ±r

# renameConversationHint
source: Enter new title
tr: Yeni baÅŸlÄ±k girin

# searchConversationsHint
source: Search conversations...
tr: KonuÅŸmalarÄ± ara...

source: No conversations found
tr: KonuÅŸma bulunamadÄ±

source: No conversations yet
tr: HenÃ¼z konuÅŸma yok

# conversationsCount
source: {count, plural, =0{0 conversations} =1{1 conversation} other{{count} conversations}}
tr: {count, plural, =0{0 konuÅŸma} =1{1 konuÅŸma} other{{count} konuÅŸma}}

# pinnedLabel
source: Pinned
tr: Sabitlenenler

# archivedLabel
source: Archived
tr: Arşivlenenler

# last7DaysLabel
source: Last 7 days
tr: Son 7 gün

# olderLabel
source: Older
tr: Daha eski

# pinConversation
source: Pin
tr: Sabitle

# unpinConversation
source: Unpin
tr: Sabitlemeyi kaldır

# archiveConversation
source: Archive
tr: Arşivle

# unarchiveConversation
source: Unarchive
tr: Arşivden çıkar

# todayLabel
source: Today
tr: BugÃ¼n

# yesterdayLabel
source: Yesterday
tr: DÃ¼n

# daysAgo
source: {count, plural, =1{1 day ago} other{{count} days ago}}
tr: {count, plural, =1{1 gÃ¼n Ã¶nce} other{{count} gÃ¼n Ã¶nce}}

# weeksAgo
source: {count, plural, =1{1 week ago} other{{count} weeks ago}}
tr: {count, plural, =1{1 hafta Ã¶nce} other{{count} hafta Ã¶nce}}

# monthsAgo
source: {count, plural, =1{1 month ago} other{{count} months ago}}
tr: {count, plural, =1{1 ay Ã¶nce} other{{count} ay Ã¶nce}}

# yearsAgo
source: {count, plural, =1{1 year ago} other{{count} years ago}}
tr: {count, plural, =1{1 yÄ±l Ã¶nce} other{{count} yÄ±l Ã¶nce}}

# clearConversationTitle
source: Clear conversation
tr: KonuÅŸmayÄ± temizle

# clearConversationMessage
source: Are you sure you want to clear this conversation? This action cannot be undone.
tr: Bu konuÅŸmayÄ± temizlemek istediÄŸinize emin misiniz? Bu iÅŸlem geri alÄ±namaz.

# listeningIndicator
source: Listening... (release to stop)
tr: Dinleniyor... (bÄ±rakÄ±nca durur)

# messageHint
source: Message Selcuk AI Assistant...
tr: Selçuk YZ Asistan'a yazın...

# imageSelectedTitle
source: Image selected
tr: GÃ¶rsel seÃ§ildi

# imageSelectedMessage
source: Image: {fileName}
tr: GÃ¶rsel: {fileName}

# startConversationTitle
source: Start a conversation
tr: Bir sohbet baÅŸlatÄ±n

# startConversationSubtitle
source: Ask me anything!
tr: Bana istediÄŸinizi sorun!

# suggestedPrompt1
source: Explain quantum computing
tr: Kuantum hesaplamayÄ± aÃ§Ä±kla

# suggestedPrompt2
source: Write a poem
tr: Bir ÅŸiir yaz

# suggestedPrompt3
source: Help with code
tr: Kod konusunda yardÄ±m

# streamErrorTitle
source: Stream error
tr: AkÄ±ÅŸ hatasÄ±

# streamInterruptedTag
source: [Stream interrupted]
tr: [AkÄ±ÅŸ kesildi]

# copyAction
source: Copy
tr: Kopyala

# editMessageTitle
source: Edit message
tr: Mesaji duzenle

# editMessageHint
source: Update your message
tr: Mesajinizi guncelleyin

# editMessageAction
source: Resend
tr: Yeniden gonder

# regenerateAction
source: Regenerate
tr: Yeniden uret

# retryAction
source: Retry
tr: Tekrar dene

# sourcesTitle
source: Sources
tr: Kaynaklar

# diagnosticsConnectionSection
source: CONNECTION
tr: BAĞLANTI

# diagnosticsBaseUrlLabel
source: Base URL
tr: Temel URL

# diagnosticsBaseUrlSource
source: Source: {source}
tr: Kaynak: {source}

# diagnosticsLatencyLabel
source: Latency
tr: Gecikme

# diagnosticsLatencyUnavailable
source: No latency recorded yet.
tr: Henüz gecikme ölçülmedi.

# diagnosticsModelLabel
source: Selected model
tr: Seçili model

# diagnosticsModelAvailable
source: Available
tr: Uygun

# diagnosticsModelUnavailable
source: Unavailable
tr: Kullanılamıyor

# diagnosticsOllamaLabel
source: Ollama health
tr: Ollama sağlığı

# diagnosticsOllamaReady
source: Ready
tr: Hazır

# diagnosticsOllamaUnavailable
source: Unavailable
tr: Uygun değil

# diagnosticsOllamaButton
source: Test /health/ollama
tr: /health/ollama test et

# diagnosticsOllamaDetail
source: Status: {status} | Model: {model} | {availability} | Models: {count}
tr: Durum: {status} | Model: {model} | {availability} | Modeller: {count}

# diagnosticsHfLabel
source: HF GPU Ready
tr: HF GPU Hazir

# diagnosticsHfReady
source: Ready
tr: Hazir

# diagnosticsHfUnavailable
source: Unavailable
tr: Uygun degil

# diagnosticsHfButton
source: Test /health/hf
tr: /health/hf test et

# diagnosticsHealthButton
source: Test /health
tr: /health test et

# diagnosticsModelsButton
source: Test /models
tr: /models test et

# diagnosticsSourceOverride
source: User override
tr: Kullanıcı özelleştirmesi

# diagnosticsSourceDartDefine
source: Dart define
tr: Dart tanımı

# diagnosticsSourceWebRelease
source: Web release (/api)
tr: Web sürümü (/api)

# diagnosticsSourceWebDev
source: Web dev (localhost)
tr: Web geliştirme (localhost)

# diagnosticsSourceAndroidEmulator
source: Android emulator (10.0.2.2)
tr: Android emülatörü (10.0.2.2)

# diagnosticsSourceDesktop
source: Desktop (localhost)
tr: Masaüstü (localhost)

# diagnosticsChatButton
source: Test /chat
tr: /chat test et

# diagnosticsStreamButton
source: Test /chat/stream
tr: /chat/stream test et

# diagnosticsStreamRunning
source: Streaming...
tr: Akış sürüyor...

# diagnosticsLastErrorTitle
source: Last error
tr: Son hata

# diagnosticsErrorStatusLabel
source: Status
tr: Durum

# diagnosticsErrorBodyLabel
source: Body
tr: İçerik

# diagnosticsErrorHeadersLabel
source: Headers
tr: Üstbilgiler

# diagnosticsNoErrors
source: No errors recorded yet.
tr: Henüz hata yok.

# diagnosticsStreamSampleTitle
source: SSE sample
tr: SSE örneği

# diagnosticsNoStreamSample
source: No stream events captured.
tr: Akış olayı yakalanmadı.

# diagnosticsLogsTitle
source: Diagnostics log
tr: Tanılama günlüğü

# diagnosticsCopyLog
source: Copy log
tr: Günlüğü kopyala

# diagnosticsNoLogs
source: No diagnostics run yet.
tr: Henüz tanılama yapılmadı.

# diagnosticsTestMessage
source: Hello
tr: Merhaba

# microphonePermissionRequired
source: Microphone permission is required for voice input
tr: Sesli giriÅŸ iÃ§in mikrofon izni gerekli

# speechNotAvailable
source: Speech recognition is not available
tr: Ses tanÄ±ma kullanÄ±lamÄ±yor

# enterMessagePrompt
source: Please enter a message or use voice input!
tr: LÃ¼tfen bir mesaj yazÄ±n veya sesli giriÅŸ kullanÄ±n!

# exportFailedTitle
source: Export failed
tr: DÄ±ÅŸa aktarma baÅŸarÄ±sÄ±z

source: No messages to export
tr: DÄ±ÅŸa aktarÄ±lacak mesaj yok

# exportSuccessTitle
source: Export successful
tr: DÄ±ÅŸa aktarma baÅŸarÄ±lÄ±

# exportSuccessMessage
source: Saved to {path}\nAlso copied to clipboard
tr: Åuraya kaydedildi: {path}\nAyrÄ±ca panoya kopyalandÄ±

# exportSuccessWebMessage
source: Downloaded file and copied to clipboard
tr: Dosya indirildi ve panoya kopyalandÅ½Ã±

source: Logout
tr: Ã‡Ä±kÄ±ÅŸ

source: Clear chat
tr: Sohbeti temizle

source: Export chat
tr: Sohbeti dÄ±ÅŸa aktar

# logoutSuccessTitle
source: Success
tr: BaÅŸarÄ±lÄ±

# logoutSuccessMessage
source: Logged out successfully
tr: Ã‡Ä±kÄ±ÅŸ yapÄ±ldÄ±

# logoutErrorTitle
source: Error
tr: Hata

source: Copied to clipboard
tr: Panoya kopyalandÄ±

# yesterdayAt
source: Yesterday {time}
tr: DÃ¼n {time}

# aiThinking
source: AI is thinking...
tr: Yapay zeka dÃ¼ÅŸÃ¼nÃ¼yor...

# infoTitle
source: Info
tr: Bilgi

# successTitle
source: Success
tr: BaÅŸarÄ±lÄ±

# errorTitle
source: Error
tr: Hata

# imagePickerErrorTitle
source: Error
tr: Hata

# imagePickerErrorMessage
source: Failed to pick image: {error}
tr: GÃ¶rsel seÃ§ilemedi: {error}

# chooseImageSourceTitle
source: Choose image source
tr: GÃ¶rsel kaynaÄŸÄ±nÄ± seÃ§in

# cameraLabel
source: Camera
tr: Kamera

# galleryLabel
source: Gallery
tr: Galeri

# appwritePingSuccess
source: Appwrite connection is successful!
tr: Appwrite baÄŸlantÄ±sÄ± baÅŸarÄ±lÄ±!

# appwritePingNoSession
source: Appwrite connection is OK but no session is active.
tr: Appwrite baÄŸlantÄ±sÄ± var ama oturum aÃ§Ä±k deÄŸil.

# appwritePingError
source: Appwrite ping error: {error}
tr: Appwrite ping hatasÄ±: {error}

# sendPingTooltip
source: Send a ping
tr: Ping gÃ¶nder

# logoutTooltip
source: Logout
tr: Ã‡Ä±kÄ±ÅŸ

# assistantTitle
source: AI assistant
tr: Yapay zeka asistanÄ±

# assistantHint
source: Type a message or hold for voice input...
tr: Bir mesaj yazÄ±n veya sesli giriÅŸ iÃ§in basÄ±lÄ± tutun...

# listeningStatus
source: Listening to voice input...
tr: Ses giriÅŸi dinleniyor...

# startChatHint
source: Start chatting with the AI assistant!
tr: Yapay zeka asistanÄ±yla konuÅŸmaya baÅŸlayÄ±n!

source: Error: Invalid request
tr: Hata: GeÃ§ersiz istek

source: Error: Invalid request format.
tr: Hata: GeÃ§ersiz istek formatÄ±.

# errorServiceUnavailable
source: Error: AI service is unavailable.
tr: Hata: Yapay zeka hizmeti kullanÄ±lamÄ±yor.

# errorTimeout
source: Error: AI response timeout.
tr: Hata: YanÄ±t zaman aÅŸÄ±mÄ±na uÄŸradÄ±.

# errorBackendUnavailable
source: Error: Backend service unavailable.
tr: Hata: Sunucu hizmeti kullanÄ±lamÄ±yor.

# errorNoInternet
source: Error: No internet connection.
tr: Hata: Ä°nternet baÄŸlantÄ±sÄ± yok.

source: Error: Invalid server response.
tr: Hata: GeÃ§ersiz sunucu yanÄ±tÄ±.

# errorUnexpected
source: Error: Unexpected error.
tr: Hata: Beklenmeyen hata.

# noResponseGenerated
source: Sorry, no response generated.
tr: ÃœzgÃ¼nÃ¼m, yanÄ±t Ã¼retilemedi.

# requestTimeoutMessage
source: Request timed out. Please try again.
tr: Ä°stek zaman aÅŸÄ±mÄ±na uÄŸradÄ±. LÃ¼tfen tekrar deneyin.

# speechRecognitionFailed
source: Speech recognition failed. Please try again.
tr: Ses tanÄ±ma baÅŸarÄ±sÄ±z oldu. LÃ¼tfen tekrar deneyin.

# speechRecognitionError
source: Speech recognition error. Please check your network.
tr: Ses tanÄ±ma hatasÄ±. LÃ¼tfen aÄŸ baÄŸlantÄ±nÄ±zÄ± kontrol edin.

source: Server connection failed.
tr: Sunucu baÄŸlantÄ±sÄ± baÅŸarÄ±sÄ±z.
